In [ ]:
# Import library
import sqlite3
from sqlite3 import Error

In [ ]:
# Connect to an SQLite database; use ':memory:' for an in-memory database
conn = sqlite3.connect(':memory:')

# Connect to a remote compatible SQL server
# conn = sqlite3.connect('host=hostname user=username password=password dbname=database_name')

# USE IF YOU WANT TO LOAD/SAVE THE DATABASE AS A BINARY FILE TO ACCESS LATER
# def create_connection(db_file):
#     """ create a database connection to the SQLite database
#         specified by db_file
#     :param db_file: database file
#     :return: Connection object or None
#     """
#     conn = None
#     try:
#         conn = sqlite3.connect(db_file)
#         return conn
#     except Error as e:
#         print(e)

#     return conn

# conn = create_connection('testing.db')

In [ ]:
# Execute a SQL command to create a new table
c = conn.cursor()
c.execute('''
          CREATE TABLE stocks
          (date text, trans text, symbol text, qty real, price real)
          ''')

In [ ]:
# Execute a SQL command to insert data into the table
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','ABC',100,35.14)")

# Commit the transaction to save changes to the database
conn.commit()

In [ ]:
# Execute a SQL SELECT statement to query the database
c.execute("SELECT * FROM stocks WHERE trans='BUY'")

# Fetch all rows from the result of the query
print(c.fetchall())

[('2006-01-05', 'BUY', 'ABC', 100.0, 35.14)]

In [ ]:
# Execute a SQL SELECT statement to query the database
c.execute("SELECT * FROM stocks")

# Fetch all rows from the result of the query
print(c.fetchall())

[('2006-01-05', 'BUY', 'ABC', 100.0, 35.14)]

In [ ]:
def execute_querry(conn, sql_querry):
    """ create a table from the create_table_sql statement
    :param conn: Connection object
    :param create_table_sql: a CREATE TABLE statement
    :return:
    """
    try:
        c = conn.cursor()
        c.execute(sql_querry)
    except Error as e:
        print(e)

    print(c.fetchall())

In [ ]:
sql_create_projects_table = """ CREATE TABLE IF NOT EXISTS projects (
                                        id integer PRIMARY KEY,
                                        name text NOT NULL,
                                        begin_date text,
                                        end_date text
                                    ); """

sql_create_tasks_table = """CREATE TABLE IF NOT EXISTS tasks (
                                    id integer PRIMARY KEY,
                                    name text NOT NULL,
                                    priority integer,
                                    status_id integer NOT NULL,
                                    project_id integer NOT NULL,
                                    begin_date text NOT NULL,
                                    end_date text NOT NULL,
                                    FOREIGN KEY (project_id) REFERENCES projects (id)
                                );"""

list_all_tables = """SELECT name FROM sqlite_master WHERE type='table';"""

# create tables
if conn is not None:

  # create projects table
  execute_querry(conn, sql_create_projects_table)

  # create tasks table
  execute_querry(conn, sql_create_tasks_table)

  # lsit created tables
  execute_querry(conn, list_all_tables)

else:
  print("Error! cannot create the database connection.")

[]
[]
[('stocks',), ('projects',), ('tasks',)]

In [ ]:
# THE TASK
# Import the Titanic Dataset

import pandas as pd
import seaborn as sns

# Load the Titanic dataset from seaborn
titanic_df = sns.load_dataset('titanic')
for column in titanic_df:
  print(column)

print(titanic_df.head())

survived
pclass
sex
age
sibsp
parch
fare
embarked
class
who
adult_male
deck
embark_town
alive
alone
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [ ]:
# WITH SQL QUERRIES TRY TO ANSWEAR THESE QUESTIONS:

# EASY
# WHAT % OF PASSENGERS SURVIVED?
# WHAT WAS THE AGE OF THE YOUNGEST AND OLDEST PERSON THAT SURVIVED?
# HOW MANY PASSENGERS WERE IN EACH CLASS?

# ADVANCED
# HOW MANY PEOPLE SURVIVED OUT OF THE 10% LOWEST FARES PAID FOR THE CRUISE?
# HOW MANY PEOPLE SURVIVED THAT PAID AT LEAST $70 FOR THE CRUISE?

In [ ]:
titanic_df.to_sql(name='titanic', con=conn)

891

In [ ]:
execute_querry(conn, "Select 1.0 * sum(survived)/count(survived) FROM titanic")

[(0.3838383838383838,)]

In [ ]:
execute_querry(conn, "select count(survived) from (Select survived, fare FROM titanic order by fare asc limit 89) where survived = 1")

[(12,)]

In [ ]:
execute_querry(conn, "SELECT count(sex) FROM titanic where sex='male' and survived=0")

[(468,)]

In [ ]:
def execute_querry(conn, sql_querry):
    """ create a table from the create_table_sql statement
    :param conn: Connection object
    :param create_table_sql: a CREATE TABLE statement
    :return:
    """
    try:
        c = conn.cursor()
        c.execute(sql_querry)
    except Error as e:
        print(e)

    print(f"Returned values: {c.fetchall()[0]}")
    return c.fetchall()

In [ ]:
out = execute_querry(conn, "SELECT count(sex) FROM titanic where sex='male' and survived=0")

In [ ]:
out

[(468,)]

In [ ]:
out[0][0]

468

In [ ]:
execute_querry(conn, "SELECT deck, pclass, count(*) FROM titanic group by deck")

[(None, 3, 688),
 ('A', 1, 15),
 ('B', 1, 47),
 ('C', 1, 59),
 ('D', 2, 33),
 ('E', 1, 32),
 ('F', 2, 13),
 ('G', 3, 4)]

In [ ]:
execute_querry(conn, "SELECT deck, pclass FROM titanic ")

[(None,), ('C',), ('E',), ('G',), ('D',), ('A',), ('B',), ('F',)]

In [ ]:
execute_querry(conn, "SELECT DISTINCT pclass FROM titanic")

[(3,), (1,), (2,)]

In [ ]:
execute_querry(conn, "SELECT deck, GROUP_CONCAT(DISTINCT pclass ORDER BY pclass ASC) AS classes FROM titanic WHERE deck IS NOT NULL GROUP BY deck ORDER BY deck ASC;")

near "ORDER": syntax error

[]